import { IDefinition } from "../interface/IDefinition";

export const glossary: IDefinition[] = [
  {name: "Язык программирования", meaning: "Формальный язык, предназначенный для записи компьютерных программ"},
  {name: "Производительность", meaning: "Эффективность работы программы"},
  {name: "Java", meaning: "Строго типизированный объектно-ориентированный язык программирования общего назначения, разработанный компанией Sun Microsystems"},
  {name: "JavaScript", meaning: "Мультипарадигменный язык программирования, поддерживает объектно-ориентированный, императивный и функциональный стили"},
  {name: "Программа", meaning: "Описание на формальном языке, понятном компьютеру, последовательности действий, которые необходимо выполнить над данными для решения поставленной задачи"},
  {name: "Время работы", meaning: "Временной промежуток между началом работы программы и её окончанием"},
  {name: "Бенчмарк", meaning: "Выполнение тестового задания вычислительной системой (изначально, компьютером) для определения ее производительности"},
  {name: "JMH", meaning: "Де-факто стандарт для тестов производительности в JDK"},
  {name: "matcha", meaning: "Популярный фреймворк для тестирования JavaScript-приложений"},
  {name: "Баг", meaning: "Ошибка в программе (дефект), вызывающая сбой или непредсказуемость её работы"},
  {name: "Дебаггинг", meaning: "Процесс поиска, нахождения и ликвидации багов"},
  {name: "Тестирование", meaning: "Процесс проверки программного обеспечения по заявленным критериям"},
  {name: "Тест-план", meaning: "Документ тестирования, в котором перечислен объем работ по тестированию"}
];